void shSort(int s[], int n){
    int i, j, d;
    int k;
    d = n / 2;											/*确定固定增量值*/
    while (d >= 1)
    {
        for (i = d + 1; i <= n; i++)								/*数组下标从d+1开始进行直接插入排序*/
        {
            s[0] = s[i];									/*设置监视哨*/
            j = i - d;										/*确定要进行比较的元素的最右边位置*/
            while ((j > 0) && (s[0] < s[j]))
            {
                s[j + d] = s[j];								/*数据右移*/
                j = j - d;									/*向左移d个位置*/
            }
            s[j + d] = s[0];							/*在确定的位置插入s[i]*/
        }
        d = d / 2;										/*增量变为原来的一半*/
    }
}
