#include <stdio.h>
void main()
{
int i,j=0;
char a[100];
char b[91]={0};           /*字符对应的ASCII码的十进制 0=48 9=57 A=65 Z=90 a=97 z=122 外加一个空格32 122-32+1=91*/
printf("请输入一个字符串:");
gets(a);                  /* scanf忽略空格以后的字符 */
for (i=0;i<strlen(a);i++)
  if (b[a[i]-32]!='1')    /*如果第一个字符a[0]是空格，那么a[0]的值是32，b[a[i]-32]=b[32-32]=b[0]。*/
  { b[a[i]-32]='1';       /* 执行此句后，b[0]=='1'，如果字符串中还有空格，那将进不了if语句，从而过重复滤字符。*/
a[j]=a[i];j++; }
  a[j]='\0';

printf("%s",a);
getch();

}

/*b[a[i]-32]代表值为32到122字符在数组b中的位置，如48的字符为b[48-32]=b[16],数组b中各元素的值不是'0'就是'1'，以确定该字符是否出现过。*/
/* a:{0=48 9=57 A=65 Z=90 a=97 z=122}*/
/* b:{0                           0 } 32...=  !"#$%&'()*+,-./0123456789:;<...*/
